apple-open-source/macos/IOUSBFamily/AppleUSBMouse/Classes/AppleUSBMouse.cpp
/*
 * Copyright (c) 1998-2003 Apple Computer, Inc. All rights reserved.
 *
 * @APPLE_LICENSE_HEADER_START@
 * 
 * Copyright (c) 1999-2003 Apple Computer, Inc.  All Rights Reserved.
 * 
 * This file contains Original Code and/or Modifications of Original Code
 * as defined in and that are subject to the Apple Public Source License
 * Version 2.0 (the 'License'). You may not use this file except in
 * compliance with the License. Please obtain a copy of the License at
 * http://www.opensource.apple.com/apsl/ and read it before using this
 * file.
 * 
 * The Original Code and all software distributed under the License are
 * distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
 * EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
 * INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
 * Please see the License for the specific language governing rights and
 * limitations under the License.
 * 
 * @APPLE_LICENSE_HEADER_END@
 */

#include <libkern/OSByteOrder.h>

#include <IOKit/IOBufferMemoryDescriptor.h>
#include <IOKit/IOMessage.h>

#include <IOKit/hidsystem/IOHIPointing.h>
#include <IOKit/hidsystem/IOHIDShared.h>
#include <IOKit/hidsystem/IOHIDDescriptorParser.h>

#include <IOKit/usb/IOUSBInterface.h>
#include <IOKit/usb/IOUSBPipe.h>
#include <IOKit/usb/IOUSBLog.h>

#include <IOKit/pwr_mgt/RootDomain.h>

#include "AppleUSBMouse.h"

#define super IOHIPointing
#define DEBUGGING_LEVEL 0

#define kMaxButtons	32	// Is this defined anywhere in the event headers?
#define kMaxValues	32	// This should be plenty big to find the X, Y and wheel values - is there some absolute max?

#define kDefaultFixedResolution (400 << 16)

OSDefineMetaClassAndStructors(AppleUSBMouse, IOHIPointing)

static	bool switchTo800dpi = true;

bool 
AppleUSBMouse::init(OSDictionary * properties)
{
#if (DEBUGGING_LEVEL > 1)
    IOLog("Calling AppleUSBMouse::init.\n");
#endif

  if (!super::init(properties))  return false;

   // Initialize minimal state: fields that have access methods that may
   // be called before AppleUSBMouse::start().
    _numButtons = 1;
    _resolution = kDefaultFixedResolution;
    _preparsedReportDescriptorData = NULL;
    _buttonCollection = -1;
    _xCollection = -1;
    _yCollection = -1;
    _tipPressureCollection = -1;
    _digitizerButtonCollection = -1;
    _scrollWheelCollection = -1;
    _hasInRangeReport = false;
    _tipPressureMin = 255;
    _tipPressureMax = 255;
    _retryCount = kMouseRetryCount;
    _deviceIsDead = false;
    _deviceHasBeenDisconnected = false;
    _outstandingIO = 0;
    _needToClose = false;
    return true;
}



bool 
AppleUSBMouse::start(IOService * provider)
{
    IOReturn			err = 0;
    IOWorkLoop			*wl;
    OSNumber *			locationIDProperty;
    UInt32			locationID = 0;

    USBLog(3, "%s[%p]::start - beginning - retain count = %d", getName(), this, getRetainCount());
    _interface		= OSDynamicCast(IOUSBInterface, provider);
    if (!_interface)
        return false;
    
    if( !_interface->open(this))
    {
        USBError(1, "%s[%p]::start - unable to open provider. returning false", getName(), this);
        return (false);
    }

    do {
        IOUSBFindEndpointRequest request;

	// remember my device
	_device = _interface->GetDevice();
	if (!_device)
	{
	    USBError(1, "%s[%p]::start - unable to get handle to my device - something must be wrong", getName(), this);
	    break;	// error
	}

        if (!parseHIDDescriptor()) 
        {
            USBError(1, "%s[%p]::start - unable to parse HID descriptor", getName(), this);
            break;
        }

        if ((_device->GetVendorID() == kIOUSBVendorIDAppleComputer) && (_device->GetProductID()  == 0x0306))
        {
            UInt32 	resPrefInt;
            IOFixed	resPref;

            OSNumber * resPrefPtr = (OSNumber *)getProperty("xResolutionPref");
            if (resPrefPtr)
            {
                resPrefInt = resPrefPtr->unsigned32BitValue();
            }
            else
            {
                resPrefInt = kDefaultFixedResolution * 2;
            }

            resPref = (IOFixed) resPrefInt;
            
            if (resPref != _resolution)
            {
		if (switchTo800dpi)
		{
		    IOUSBDevRequest		devReq;
    
		    devReq.bmRequestType = 0x40;
		    devReq.bRequest = 0x01;
		    devReq.wValue = 0x05AC;
		    devReq.wIndex = 0x0452;
		    devReq.wLength = 0x0000;
		    devReq.pData = NULL;
		
		    err = _device->DeviceRequest(&devReq, 5000, 0);
		    
		    if (err) 
		    {
			USBLog(3, "%s[%p]::start - error (%x) setting resolution", getName(), this, err);
			break;		// Don't go on to read.
		    }
		    // with this mouse, we do NOT want to start reading on the interrupt pipe, nor do
		    // we want to call super::start. We just want to wait for the device to get terminated
		    USBLog(3, "%s[%p]::start - waiting for click mouse termination", getName(), this);
    
		    return true;
		}
            }
            else
            {
                // If we are already at the correct resolution for OSX, OK. But what if we are going
                // back to OS 9? On restart, switch back to boot setup. Power Manager will tell us
                // when we are going to restart.
                //
                _notifier = registerPrioritySleepWakeInterest(PowerDownHandler, this, 0);
            }
        }

        _gate = IOCommandGate::commandGate(this);

        if(!_gate)
        {
            USBError(1, "%s[%p]::start - unable to create command gate", getName(), this);
            break;
        }

	wl = getWorkLoop();
	if (!wl)
	{
            USBError(1, "%s[%p]::start - unable to find my workloop", getName(), this);
            break;
	}
	
        if (wl->addEventSource(_gate) != kIOReturnSuccess)
        {
            USBError(1, "%s[%p]::start - unable to add gate to work loop", getName(), this);
            break;
        }

        request.type = kUSBInterrupt;
        request.direction = kUSBIn;
        _interruptPipe = _interface->FindNextPipe(NULL, &request);

